# DividedSurfaceDisplaySurfaceOption Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DividedSurfaceDisplaySurfaceOption Property
ParameterTypeId Class See Also
---
"Display Surface Option"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DividedSurfaceDisplaySurfaceOption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfaceDisplaySurfaceOption As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DividedSurfaceDisplaySurfaceOption {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace